Repository: acesrg/nyquist
Catalog: docs/source/locale/*/LC_MESSAGES/api.po
Languages: es

source: Lab Client
es: Hablar con el experimento

source: The System Class
es: La clase *System*

source: Generates an object with the complete resource tree as attributes.
es: Genera un objeto con todos el arbol de recursos como atributos.

source: An instance from System defines a laboratory sistem completely, and allows the user to interact with it.
es: Una instancia de *System* define completamente a un experimento, y permite al usuario interactuar con el.

source: Given an string with the name of the device to control, the library will load the default values for it's configuration. Said configuration can also be modified via keyword optional arguments.
es: Dada una cadena de caracteres con el nombre del experimento, la biblioteca cargara los valores por defecto con su configuración. La misma también puede ser modificada a través de *keyword arguments*.

source: The last word of each URL, each resource is an :class:`_HTTPEndpoint` or :class:`_WSEndpoint`, that according the methods assigned to the resource, will have a :meth:`~nyquist._private.network.http._HTTPResourcer.get` and/or :meth:`~nyquist._private.network.http._HTTPResorcer.post` method... or :meth:`~nyquist._private.network.ws._WSResourcer.get` and/or :meth:`~nyquist._private.network.ws._WSResorcer.post` method. The latter ones are much faster, but require an open websockets stream.
es: La última palabra de cada URL, cada recurso es un :class:`_HTTPEndpoint` ó :class:`_WSEndpoint`, que según las funciones asignadas al recurso tendrán un :meth:`~nyquist._private.network.http._HTTPResourcer.get` y/ó :meth:`~nyquist._private.network.http._HTTPResorcer.post` método/s... ó bien :meth:`~nyquist._private.network.ws._WSResourcer.get` y/ó :meth:`~nyquist._private.network.ws._WSResorcer.post` métodos. Estos dos últimos representan comunicaciones mucho mas veloces, pero requieren un *web-socket*, abierto.

source: Parameters
es: Parámetros

source: The system name.
es: El nombre del experimento.

source: An IP address or domain.
es: Una dirección IP o dominio.

source: Set of HTTP resources.
es: Grupo de recursos HTTP.

source: Set of Websocket resources.
es: Grupo de recursos Websockets.

source: Destination HTTP port.
es: Puerto HTTP de destino.

source: Destination Websocket port.
es: Puerto Websockets de destino.

source: Timeout for each request.
es: Máxima espera para cada petición.

source: Methods for HTTP endpoints
es: Funciones para *endpoints* HTTP.

source: Gets the value of a resource.
es: Obtiene el valor de un recurso.

source: The resource whose value we want. If using any :class:`nyquist.lab.client.System` object, this argument mustn't be passed.
es: El recurso cuyo valor queremos. Is estamos usando cualquier objeto :class:`nyquist.lab.client.System`, este argumento debe ser omitido.

source: The type of return value we expect.
es: El tipo de valor de retorno que esperamos.

source: Returns
es: Retorna

source: The value of the resource.
es: El valor del recurso.

source: Return type
es: Tipo de valor de retorno

source: The resource whose value we want to set. If using any :class:`nyquist.lab.client.System` object, this argument mustn't be passed.
es: El recurso cuyo valor queremos modificar. Si estamos usando cualquier objeto :class:`nyquist.lab.client.System`, este argumento debe ser omitido.

source: The resource whose value we want to set.
es: El recurso cuyo valor queremos modificar.

source: The return code.
es: El código de respuesta.

source: Methods for WS endpoints
es: Métodos para *endpoints* Websockets.

source: Gets the last telemetry value of given resource.
es: Obtiene el último valor de telemetría, del recurso dado.

source: If the telemetry is not initialized (socket not opened yet) it opens a websocket and starts receiving telemetry asynchronously. Said telemetry will be saved, and can be retrieved by this method.
es: Si la telemetría no ha sido inicializada (el socket aún no ha sido abierto) abre un *websocket* y comienza a recibir telemetría de forma asincrónica. Dicha telemetría será guardada y puede ser consultada con ésta función.

source: Is most likely that this method will return None the first time it's called, so it's advised to call it in the after_script first.
es: Lo mas probable es que esta función devuelva None la primera vez que es llamada, por lo tanto es recomendable llamarla en el script anterior al lazo de control.

source: Every call of this method will set :attr:`~nyquist._private.network.ws._WSResourcer.new_message` to False, and every time a new message is stored, that attribute will be set to true. This way the user can implement methods to avoid reading the same message twice.
es: Cada llamada de esta función seteará :attr:`~nyquist._private.network.ws._WSResourcer.new_message` a False, y cada vez que un nuevo mensaje sea guardado, dicho atributo será restaurado a True. De esta forma el usuario podrá implementar funciones para evitar leer el mismo valor dos veces.

source: Sets the value of a resource through a fast channel, asynchronously.
es: Setea el valor de un recurso a través del canal rápido, de forma asincrónica.

source: Experiments
es: Experimentos

source: Defining the control algorithm
es: Definir un algoritmo de control

source: The user should define this method. When :meth:`Experiment.run` is called, this method will run first. Then it will wait for some time that can be set with :meth:`Experiment.set_before_loop_time` and after said delay, it will run the loop.
es: El usuario debe definir esta función. Cuando se invoque a :meth:`Experiment.run` este método será el primero en ejecutarse. Luego se esperará por un tiempo definido mediante :meth:`Experiment.set_before_loop_time`. Luego de dicha espera, se ejecutará el lazo de control.

source: The user should define this method. When :meth:`Experiment.run` is called, this method will run in a loop, after :meth:`Experiment.before_the_loop`. This method will run in a loop with a frequency established by :meth:`Experiment.set_loop_frequency`.
es: El usuario debe definir esta función. Durante la ejecución de :meth:`Experiment.run` y luego de ejecutar :meth:`Experiment.before_the_loop`, este método se ejecutará en un bucle con frecuencia establecida por :meth:`Experiment.set_loop_frequency`

source: The user should define this method. When :meth:`Experiment.run` is called, this method will run after the loop, and after a delay that can be configured with :meth:`Experiment.set_after_loop_time`.
es: El usuario debe definir esta función. Cuando se ejecute :meth:`Experiment.run` este método se ejecutará luego del bucle, y luego de un período de espera que puede ser configurado mediante :meth:`Experiment.set_after_loop_time`.

source: Experiment object configuration
es: Configuración del objeto experimento

source: Define the frequency of the control-loop [Hz].
es: Define la frecuencia [Hz] del lazo de control.

source: The frequency in hertz.
es: La frecuencia en *Hertz*.

source: Define the simulation run time [s]. This includes only the time spent inside the control loop.
es: Define el tiempo de simulación [s]. Esto incluye solo el tiempo empleado durante el el lazo de control.

source: The time in seconds.
es: El tiempo en segundos.

source: Set the delay time between the :meth:`Experiment.before_the_loop` and the start of the loop.
es: Setea el tiempo entre :meth:`Experiment.before_the_loop` y el comienzo del bucle.

source: Set the delay time between end of the loop and :meth:`Experiment.after_the_loop`.
es: Setea el tiempo entre el fin del bucle y :meth:`Experiment.after_the_loop`.

source: Execution
es: Ejecución

source: Execute the control experiment, run:
es: Ejecuta un experimento de control, corre:
